Revit 2027 API
View.IsolateElementsTemporary Method
 Set multiple elements to be temporarily isolated in the view. To isolate a group completely, you must also include all members of all groups and nested groups in your input.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void IsolateElementsTemporary(
	ICollection<ElementId> elementIds
)
Public Sub IsolateElementsTemporary (
	elementIds As ICollection(Of ElementId)
)
public:
void IsolateElementsTemporary(
	ICollection<ElementId^>^ elementIds
)
member IsolateElementsTemporary :
        elementIds : ICollection<ElementId> -> unit
Parameters
elementIds ICollection<ElementId>
 Ids of elements to be isolated.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
View Class
Autodesk.Revit.DB Namespace